FTClose = "Close";
FTOkay = "OK";
FTCancel = "Cancel";

FTVerifyFileFindTitle = "Select File to Verify against";
FTVerifyFileFindPrompt = "Select Original File";

FTEnterPassphrasePrompt = "For key:  %@, %@";
FTEnterPassphraseAgainPrompt = "Try again:  %@, %@";
FTEnterPassphraseForSymmetricKeyPrompt = "For symmetrically encrypted data";

FTGetRecipient = "Choose a recipient";
FTGetRecipients = "Choose recipients";
FTGetSigner = "Choose a signer";
FTGetSigners = "Choose signers";

FTSignatureStatus = "Signature Status";
FTMultipleSignatureStatuses = "Multiple Signature Statuses";
FTGoodSigStatus = "Good signature made %@ with %@ validity from:\n\n%@\n%@";
FTBadSigStatus = "Bad signature made %@ with %@ validity from:\n\n%@\n%@";
FTGoodButExpiredSigStatus = "Good, but EXPIRED, signature made %@ with %@ validity from:\n\n%@\n%@";
FTGoodButKeyExpiredSigStatus = "Good signature made %@ with %@ validity from EXPIRED key:\n\n%@\n%@";
FTNoKeySigStatus = "No such key in your keyring:\n\n%@.";
FTNoSignatureSigStatus = "No signature on data.";
FTErrorSigStatus = "An error occured while trying to verify the data.";
FTSigSeparator = "\n------------------------\n";

FTErrorTitle = "Error";
FTErrorMessage = "An error occured:  %@";

FTSecureDeleteSucceededTitle = "Original File Securely Deleted";
FTSecureDeleteSucceededMessage = "The original file was successfully securely deleted.  This window will now close because the file no longer exists.";
FTSecureDeleteFailedTitle = "Secure Delete of Original File Failed";
FTSecureDeleteFailedMessage = "Was unable to securely delete the original file.  It may be in use by another application or you may not have permission to delete it.  Look at it in the Finder for details.";
FTWarningTitle = "Warning";
FTSecureDeleteWarningMessage = "You are about to securely delete the original file.  Once it is securely deleted you will not be able to recover it.  Are you sure you want to delete it?";